#include <iostream>

using namespace std;

int main() {
    int M[3][3] = { {1,2,3}, {4,5,6}, {7,8,9} };

    int (*ptr)[3]; // 포인터 to 배열
    int *p;     // 포인터
    int **pt;   // 이중 포인터

    ptr = M;

    // ptr, M은 첫 주소를 가리킴 
    cout << (*ptr)[0] << " " << M[0][0] << '\n';    // 1 1
    cout << (*(ptr+1))[0] << " " << (*(M+1))[0] << '\n';    // 4 4
    cout << *(ptr[1]) << " " << *(M[1]) << " " << **(M+1) << " " << M[1][0] << '\n'; // 4 4 4 4
    cout << **(ptr+1) << " " << **(M+1) << " " << *M[1] << " " << M[1][0] << '\n';  // 4 4 4 4

    p = M[0];
    cout << *p << " " << *M[0] << " " << **M << '\n';   // 1 1 1
    cout << *(p+1) << " " << *(M[0]+1) << " " << *(*M+1) << '\n'; // 2 2 2
    cout << *(p+1) << " " << *(M[0]+1) << " " << *(*(M)+1) << '\n'; // 2 2 2

    pt = &p;
    cout << **pt << " " << *p << '\n';

    cout << "소프트웨어학과 2021041017 김규현" << "\n";

    return 0;
}